lec03.org
#+STARTUP: indent
#+TITLE:     第3讲　Linux基础(2)
#+AUTHOR:    王晓庆
#+EMAIL:     wangxaoqing@outlook.com
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:1 \n:nil ':t @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+startup: beamer
#+LATEX_CLASS: beamer
#+BEAMER_FRAME_LEVEL: 3
#+BEAMER_HEADER_EXTRA: \institute{wangxiaoqing@outlook.com}
#+LaTeX_CLASS_OPTIONS: [xcolor=svgnames,presentation]
#+LaTeX_CLASS_OPTIONS: [t]
#+LATEX_HEADER:\usecolortheme[named=FireBrick]{structure}\setbeamercovered{transparent}\setbeamertemplate{caption}[numbered]\setbeamertemplate{blocks}[rounded][shadow=true] \usetheme{Darmstadt}\date{\today} \usepackage{tikz}\usepackage{xeCJK}\usepackage{amsmath}\setmainfont{Times New Roman}\setCJKmainfont[BoldFont={Adobe Heiti Std},ItalicFont={Adobe Fangsong Std}]{Adobe Heiti Std}\setCJKsansfont{Adobe Heiti Std}\setCJKmonofont{Adobe Fangsong Std}\usepackage{verbatim}\graphicspath{{figures/}} \definecolor{lstbgcolor}{rgb}{0.9,0.9,0.9} \usepackage{listings}\usepackage{minted} \usepackage{fancyvrb}\usepackage{xcolor}\lstset{escapeinside=`',frameround=ftft,language=C,breaklines=true,keywordstyle=\color{blue!70},commentstyle=\color{red!50!green!50!blue!50},frame=shadowbox,backgroundcolor=\color{yellow!20},rulesepcolor=\color{red!20!green!20!blue!20}}
#+LaTeX_HEADER: \usemintedstyle{default}

* 用户和组管理
** 帐号分类
*** 帐号
**** 帐号(account)是用于记录用户或用户组的数据
**** Linux中每一个合法用户都必须拥有帐号才能登录使用系统
**** Linux依靠帐号来验证用户身份并设置用户权限
*** 用户帐号和组帐号
**** 用户帐号：每个用户帐号存储某个用户的数据
**** 组帐号：每个组帐号存储某个用户组的数据
**** CentOS中最多可以建立2**30个帐号和2**30个组帐号
*** 根据帐号位置分类
**** 本机帐号(local account)
***** 帐号数据存储于本机硬盘内
***** 帐号有效范围仅限于本机
***** 优点：简单易用，无需额外设置即可直接创建
***** 缺点：不具备可扩展性，设想一个数百台设备的环境，要让某个帐号在每台设备上都能登录，则必须在每台设备上建立该帐号
**** 域帐号(domain account)
***** 将大量计算机组织成一个域，并在其中一台设备上建立帐号数据，并通过某些通信协议实现帐号数据的远程访问
***** 优点：具备可扩展性
***** 缺点：配置域帐号必须要先建立域环境
*** 根据帐号功能分类
**** 用户帐号
***** 超级用户：用户名通常为root，其UID一定为0
****** 权限不受任何限制
****** 不要轻易以root用户身份使用Linux系统。
***** 普通用户：除超级用户外的其他所有帐号
****** 系统帐号
******* 仅提供给Linux系统本身使用，某些软件运行时需要一个普通用户身份
******* 在CentOS 5中，系统用户的UID为1~499之间
****** 真实用户
******* 真实用户就是可以用于登录系统的普通帐号
******* 真实用户的UID在500～4,294,967,295之间
*** 根据帐号功能分类
**** 组帐号
***** 超级用户组
****** root组，GID为0，但组成员不具备系统管理权力，受系统权限限制
***** 系统组
****** 类似于系统帐号，仅提供给系统本身或某个软件使用
****** 在CentOS 5中，系统组的GID范围为1～499
***** 用户自定义组
****** 除root组和系统组之外的组，都可以由管理员自行定义
****** 用户自定义组的GID在500～4,294,967,295之间
****** 用户私有组(User Private Group, UPG)
1. 是指与用户账户名称相同的组，是用户默认的基本组
2. 当建立新用户时，CentOS会自动建立该用户的私有组
3. 用户还可以加入多个其他的组，也叫用户的附加组
** 帐号内容
*** 用户帐号
**** 用户帐号数据和密码分别存储于/etc/passwd和/etc/shadow中
#+BEGIN_SRC sh
less /etc/passwd
less /etc/shadow
man 5 passwd
man 5 shadow
#+END_SRC
**** 说明                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
1. 如果密码字段为空，则该用户无需密码即可登录系统
2. 如果密码字段为x，则该用户名密码被存储至他处
3. 如果默认shell为/sbin/nologin，则不允许该用户登录
*** 组帐号
**** 组帐号数据和密码分别存储于/etc/group和/etc/gshadow中
#+BEGIN_SRC sh
less /etc/group
less /etc/gshadow
man 5 group
man 5 gshadow
#+END_SRC
**** 说明                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
1. CentOS不支持嵌套组，组成员只能是用户，不能是其他组
2. 组成员之间以逗号(,)分隔
** 用户帐号管理
*** 添加用户帐号
**** useradd                                                     :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
#+BEGIN_SRC sh
useradd jack
tail -1 /etc/passwd
tail -1 /etc/group
tail -1 /etc/shadow
ls /home
ls /var/spool/mail
man useradd
#+END_SRC
**** 说明                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
用useradd添加新用户时，如果未指定选项，则useradd会根据/etc/login.defs与/etc/default/useradd中的配置添加新用户。
*** 设置/修改用户密码
**** 示例                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
passwd jack    #为指定用户设置密码(仅root)
passwd         #修改当前用户密码
passwd -l jack #锁定用户(仅root)
passwd -u jack #解锁用户(仅root)
passwd -d jack #清除用户密码(本地免密码登录)
#+END_SRC
**** 说明                                                        :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
让用户免密码本地登录的两种方法：
1. 将/etc/passwd文件中的密码字段清空
2. 将/etc/shadow文件中的密码字段清空
远程用户必须提供密码才允许登录!
*** 修改用户帐号
**** usermod                                                     :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
#+BEGIN_SRC sh
usermod -u 1001 bob
usermod -g 1001 bob
usermod -G root,users bob #设置bob的附加组
usermod -G '' bob         #设置bob不属于任何附加组
usermod -s /bin/csh bob
usermod -d /home/bobie
usermod -l bobie bob
usermod -L alice          #锁定帐号
usermod -U alice          #解锁帐号
#+END_SRC
**** 说明                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
usermod与useradd的选项类似，还增加了-U、-L、-l等选项。
*** 查看和删除用户帐号
**** id                                                   :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
id          #查看当前用户信息
id jack     #查看指定用户信息
#+END_SRC
**** userdel                                                     :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
#+BEGIN_SRC sh
userdel jack     #删除用户
userdel -r jack  #删除用户及其主目录和邮箱
#+END_SRC
** 组帐号管理
*** 创建、修改组
**** groupadd 创建组                                         :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
groupadd proj1
groupadd -g 1001 proj2
#+END_SRC
**** groupmod 修改组                                      :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
groupmod -g 1000 students
groupmod -n projectA proj1
#+END_SRC
*** 查询、删除组
**** groups 查询组                                        :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
groups
groups mary
#+END_SRC
**** groupdel 删除组                                      :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
groupdel projectA
#+END_SRC
**** 注意                                                        :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
#+BEGIN_EXAMPLE
注意：删除某用户的基本组之前，需要先删除该用户！
#+END_EXAMPLE
*** 组成员管理
**** gpasswd
***** gpasswd本用于设置组密码，但该功能极少使用，实际上更多用于组成员管理
**** 示例                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
gpaswd -a mary students   #将mary加入students组
gpasswd -d mary students  #从students组删除mary
gpasswd -A mary students  #将mary设置为studens组管理员
#+END_SRC
*** 切换组身份
**** newgrp                                               :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
newgrp students  #切换至students组身份
exit             #返回原先组身份
#+END_SRC
