lec03.tex
% Created 2016-03-23 三 09:09
\documentclass[xcolor=svgnames,presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\usecolortheme[named=FireBrick]{structure}\setbeamercovered{transparent}\setbeamertemplate{caption}[numbered]\setbeamertemplate{blocks}[rounded][shadow=true] \usetheme{Darmstadt}\date{\today} \usepackage{tikz}\usepackage{xeCJK}\usepackage{amsmath}\setmainfont{Times New Roman}\setCJKmainfont[BoldFont={Adobe Heiti Std},ItalicFont={Adobe Fangsong Std}]{Adobe Heiti Std}\setCJKsansfont{Adobe Heiti Std}\setCJKmonofont{Adobe Fangsong Std}\usepackage{verbatim}\graphicspath{{figures/}} \definecolor{lstbgcolor}{rgb}{0.9,0.9,0.9} \usepackage{listings}\usepackage{minted} \usepackage{fancyvrb}\usepackage{xcolor}\lstset{escapeinside=`',frameround=ftft,language=C,breaklines=true,keywordstyle=\color{blue!70},commentstyle=\color{red!50!green!50!blue!50},frame=shadowbox,backgroundcolor=\color{yellow!20},rulesepcolor=\color{red!20!green!20!blue!20}}
\usemintedstyle{default}
\providecommand{\alert}[1]{\textbf{#1}}

\title{第3讲　Linux基础(2)}
\author{王晓庆}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\institute{wangxiaoqing@outlook.com}
\begin{document}

\maketitle

\begin{frame}
\frametitle{Outline}
\setcounter{tocdepth}{1}
\tableofcontents
\end{frame}

\section{用户和组管理}
\label{sec-1}
\subsection{帐号分类}
\label{sec-1-1}
\begin{frame}
\frametitle{帐号}
\label{sec-1-1-1}
\begin{itemize}

\item 帐号(account)是用于记录用户或用户组的数据
\label{sec-1-1-1-1}%

\item Linux中每一个合法用户都必须拥有帐号才能登录使用系统
\label{sec-1-1-1-2}%

\item Linux依靠帐号来验证用户身份并设置用户权限
\label{sec-1-1-1-3}%
\end{itemize} % ends low level
\end{frame}
\begin{frame}
\frametitle{用户帐号和组帐号}
\label{sec-1-1-2}
\begin{itemize}

\item 用户帐号：每个用户帐号存储某个用户的数据
\label{sec-1-1-2-1}%

\item 组帐号：每个组帐号存储某个用户组的数据
\label{sec-1-1-2-2}%

\item CentOS中最多可以建立2**30个帐号和2**30个组帐号
\label{sec-1-1-2-3}%
\end{itemize} % ends low level
\end{frame}
\begin{frame}
\frametitle{根据帐号位置分类}
\label{sec-1-1-3}
\begin{itemize}

\item 本机帐号(local account)
\label{sec-1-1-3-1}%
\begin{itemize}

\item 帐号数据存储于本机硬盘内
\label{sec-1-1-3-1-1}%

\item 帐号有效范围仅限于本机
\label{sec-1-1-3-1-2}%

\item 优点：简单易用，无需额外设置即可直接创建
\label{sec-1-1-3-1-3}%

\item 缺点：不具备可扩展性，设想一个数百台设备的环境，要让某个帐号在每台设备上都能登录，则必须在每台设备上建立该帐号
\label{sec-1-1-3-1-4}%
\end{itemize} % ends low level

\item 域帐号(domain account)
\label{sec-1-1-3-2}%
\begin{itemize}

\item 将大量计算机组织成一个域，并在其中一台设备上建立帐号数据，并通过某些通信协议实现帐号数据的远程访问
\label{sec-1-1-3-2-1}%

\item 优点：具备可扩展性
\label{sec-1-1-3-2-2}%

\item 缺点：配置域帐号必须要先建立域环境
\label{sec-1-1-3-2-3}%
\end{itemize} % ends low level
\end{itemize} % ends low level
\end{frame}
\begin{frame}
\frametitle{根据帐号功能分类}
\label{sec-1-1-4}
\begin{itemize}

\item 用户帐号
\label{sec-1-1-4-1}%
\begin{itemize}

\item 超级用户：用户名通常为root，其UID一定为0
\label{sec-1-1-4-1-1}%
\begin{itemize}

\item 权限不受任何限制
\label{sec-1-1-4-1-1-1}%

\item 不要轻易以root用户身份使用Linux系统。
\label{sec-1-1-4-1-1-2}%
\end{itemize} % ends low level

\item 普通用户：除超级用户外的其他所有帐号
\label{sec-1-1-4-1-2}%
\begin{itemize}

\item 系统帐号
\label{sec-1-1-4-1-2-1}%
\begin{itemize}

\item 仅提供给Linux系统本身使用，某些软件运行时需要一个普通用户身份
\label{sec-1-1-4-1-2-1-1}%

\item 在CentOS 5中，系统用户的UID为1\~{}499之间
\label{sec-1-1-4-1-2-1-2}%
\end{itemize} % ends low level

\item 真实用户
\label{sec-1-1-4-1-2-2}%
\begin{itemize}

\item 真实用户就是可以用于登录系统的普通帐号
\label{sec-1-1-4-1-2-2-1}%

\item 真实用户的UID在500～4,294,967,295之间
\label{sec-1-1-4-1-2-2-2}%
\end{itemize} % ends low level
\end{itemize} % ends low level
\end{itemize} % ends low level
\end{itemize} % ends low level
\end{frame}
\begin{frame}
\frametitle{根据帐号功能分类}
\label{sec-1-1-5}
\begin{itemize}

\item 组帐号
\label{sec-1-1-5-1}%
\begin{itemize}

\item 超级用户组
\label{sec-1-1-5-1-1}%
\begin{itemize}

\item root组，GID为0，但组成员不具备系统管理权力，受系统权限限制
\label{sec-1-1-5-1-1-1}%
\end{itemize} % ends low level

\item 系统组
\label{sec-1-1-5-1-2}%
\begin{itemize}

\item 类似于系统帐号，仅提供给系统本身或某个软件使用
\label{sec-1-1-5-1-2-1}%

\item 在CentOS 5中，系统组的GID范围为1～499
\label{sec-1-1-5-1-2-2}%
\end{itemize} % ends low level

\item 用户自定义组
\label{sec-1-1-5-1-3}%
\begin{itemize}

\item 除root组和系统组之外的组，都可以由管理员自行定义
\label{sec-1-1-5-1-3-1}%

\item 用户自定义组的GID在500～4,294,967,295之间
\label{sec-1-1-5-1-3-2}%

\item 用户私有组(User Private Group, UPG)
\label{sec-1-1-5-1-3-3}%
\begin{enumerate}
\item 是指与用户账户名称相同的组，是用户默认的基本组
\item 当建立新用户时，CentOS会自动建立该用户的私有组
\item 用户还可以加入多个其他的组，也叫用户的附加组
\end{enumerate}
\end{itemize} % ends low level
\end{itemize} % ends low level
\end{itemize} % ends low level
\end{frame}
\subsection{帐号内容}
\label{sec-1-2}
\begin{frame}[fragile]
\frametitle{用户帐号}
\label{sec-1-2-1}
\begin{itemize}

\item 用户帐号数据和密码分别存储于/etc/passwd和/etc/shadow中\\
\label{sec-1-2-1-1}%
\begin{minted}[]{bash}
less /etc/passwd
less /etc/shadow
man 5 passwd
man 5 shadow
\end{minted}
\end{itemize} % ends low level
\begin{exampleblock}{说明}
\label{sec-1-2-1-2}

\begin{enumerate}
\item 如果密码字段为空，则该用户无需密码即可登录系统
\item 如果密码字段为x，则该用户名密码被存储至他处
\item 如果默认shell为/sbin/nologin，则不允许该用户登录
\end{enumerate}
\end{exampleblock}
\end{frame}
\begin{frame}[fragile]
\frametitle{组帐号}
\label{sec-1-2-2}
\begin{itemize}

\item 组帐号数据和密码分别存储于/etc/group和/etc/gshadow中\\
\label{sec-1-2-2-1}%
\begin{minted}[]{bash}
less /etc/group
less /etc/gshadow
man 5 group
man 5 gshadow
\end{minted}
\end{itemize} % ends low level
\begin{exampleblock}{说明}
\label{sec-1-2-2-2}

\begin{enumerate}
\item CentOS不支持嵌套组，组成员只能是用户，不能是其他组
\item 组成员之间以逗号(,)分隔
\end{enumerate}
\end{exampleblock}
\end{frame}
\subsection{用户帐号管理}
\label{sec-1-3}
\begin{frame}[fragile]
\frametitle{添加用户帐号}
\label{sec-1-3-1}
\begin{block}{useradd}
\label{sec-1-3-1-1}


\begin{minted}[]{bash}
useradd jack
tail -1 /etc/passwd
tail -1 /etc/group
tail -1 /etc/shadow
ls /home
ls /var/spool/mail
man useradd
\end{minted}
\end{block}
\begin{exampleblock}{说明}
\label{sec-1-3-1-2}

用useradd添加新用户时，如果未指定选项，则useradd会根据/etc/login.defs与/etc/default/useradd中的配置添加新用户。
\end{exampleblock}
\end{frame}
\begin{frame}[fragile]
\frametitle{设置/修改用户密码}
\label{sec-1-3-2}
\begin{exampleblock}{示例}
\label{sec-1-3-2-1}


\begin{minted}[]{bash}
passwd jack    #为指定用户设置密码(仅root)
passwd         #修改当前用户密码
passwd -l jack #锁定用户(仅root)
passwd -u jack #解锁用户(仅root)
passwd -d jack #清除用户密码(本地免密码登录)
\end{minted}
\end{exampleblock}
\begin{block}{说明}
\label{sec-1-3-2-2}

让用户免密码本地登录的两种方法：
\begin{enumerate}
\item 将/etc/passwd文件中的密码字段清空
\item 将/etc/shadow文件中的密码字段清空
\end{enumerate}
远程用户必须提供密码才允许登录!
\end{block}
\end{frame}
\begin{frame}[fragile]
\frametitle{修改用户帐号}
\label{sec-1-3-3}
\begin{block}{usermod}
\label{sec-1-3-3-1}


\begin{minted}[]{bash}
usermod -u 1001 bob
usermod -g 1001 bob
usermod -G root,users bob #设置bob的附加组
usermod -G '' bob         #设置bob不属于任何附加组
usermod -s /bin/csh bob
usermod -d /home/bobie
usermod -l bobie bob
usermod -L alice          #锁定帐号
usermod -U alice          #解锁帐号
\end{minted}
\end{block}
\begin{exampleblock}{说明}
\label{sec-1-3-3-2}

usermod与useradd的选项类似，还增加了-U、-L、-l等选项。
\end{exampleblock}
\end{frame}
\begin{frame}[fragile]
\frametitle{查看和删除用户帐号}
\label{sec-1-3-4}
\begin{exampleblock}{id}
\label{sec-1-3-4-1}


\begin{minted}[]{bash}
id          #查看当前用户信息
id jack     #查看指定用户信息
\end{minted}
\end{exampleblock}
\begin{block}{userdel}
\label{sec-1-3-4-2}


\begin{minted}[]{bash}
userdel jack     #删除用户
userdel -r jack  #删除用户及其主目录和邮箱
\end{minted}
\end{block}
\end{frame}
\subsection{组帐号管理}
\label{sec-1-4}
\begin{frame}[fragile]
\frametitle{创建、修改组}
\label{sec-1-4-1}
\begin{exampleblock}{groupadd 创建组}
\label{sec-1-4-1-1}


\begin{minted}[]{bash}
groupadd proj1
groupadd -g 1001 proj2
\end{minted}
\end{exampleblock}
\begin{exampleblock}{groupmod 修改组}
\label{sec-1-4-1-2}


\begin{minted}[]{bash}
groupmod -g 1000 students
groupmod -n projectA proj1
\end{minted}
\end{exampleblock}
\end{frame}
\begin{frame}[fragile]
\frametitle{查询、删除组}
\label{sec-1-4-2}
\begin{exampleblock}{groups 查询组}
\label{sec-1-4-2-1}


\begin{minted}[]{bash}
groups
groups mary
\end{minted}
\end{exampleblock}
\begin{exampleblock}{groupdel 删除组}
\label{sec-1-4-2-2}


\begin{minted}[]{bash}
groupdel projectA
\end{minted}
\end{exampleblock}
\begin{block}{注意}
\label{sec-1-4-2-3}


\begin{verbatim}
注意：删除某用户的基本组之前，需要先删除该用户！
\end{verbatim}
\end{block}
\end{frame}
\begin{frame}[fragile]
\frametitle{组成员管理}
\label{sec-1-4-3}
\begin{itemize}

\item gpasswd
\label{sec-1-4-3-1}%
\begin{itemize}

\item gpasswd本用于设置组密码，但该功能极少使用，实际上更多用于组成员管理
\label{sec-1-4-3-1-1}%
\end{itemize} % ends low level
\end{itemize} % ends low level
\begin{exampleblock}{示例}
\label{sec-1-4-3-2}


\begin{minted}[]{bash}
gpaswd -a mary students   #将mary加入students组
gpasswd -d mary students  #从students组删除mary
gpasswd -A mary students  #将mary设置为studens组管理员
\end{minted}
\end{exampleblock}
\end{frame}
\begin{frame}[fragile]
\frametitle{切换组身份}
\label{sec-1-4-4}
\begin{exampleblock}{newgrp}
\label{sec-1-4-4-1}


\begin{minted}[]{bash}
newgrp students  #切换至students组身份
exit             #返回原先组身份
\end{minted}
\end{exampleblock}
\begin{block}{说明}
\label{sec-1-4-4-2}


\begin{verbatim}
