lec03.org
**** 说明                                                        :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
#+BEGIN_EXAMPLE
如果用户不是root，下列情况下将会被提示输入组密码：
1. 如果用户没有密码而要切换的组有密码
2. 如果用户不属于要切换的组，而该组有密码
如果用户不属于要切换的组，且该组未设密码，则拒绝切换
#+END_EXAMPLE
**** sg                                                           :B_note:
:PROPERTIES:
:BEAMER_env: note
:END:
#+BEGIN_EXAMPLE
man sg   #sg与newgrp类似，但也有些不同
#+END_EXAMPLE
** 密码管理
*** 加密算法
**** DES
传统UNIX使用的加密算法，只能支持8个字符以内的密码，如果超过8个字符，则DES会忽略第8个字符以后的密码，其安全性比较差。
**** MD5
CentOS默认使用的加密算法，支持255个字符的密码，比DES更安全。
*** 查看与设置帐号秘密有效期
**** chage                                                :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
chage -l mike  #查看用户帐号密码有效期信息
#注意：普通用户只能查看自己的帐号密码有效期信息
chage -m 3 mike  #设置设定密码后至少经过几天才能修改密码
chage -M 30 mike #设置设定密码后最长多少天后必须修改密码
chage -d 2016-01-01 mike #设置密码最后修改时间
chage -E 2020-12-31 mike #设置密码过期时间
chage -W 7 mike  #设置密码过期前几天提醒
chage -I 3 mike  #设置密码过期后多少天被锁定
#+END_SRC
* 权限管理
** 基本权限管理
*** 文件权限和目录权限
**** 三种基本权限
| r--      | -w-      | --x        |
|----------+----------+------------|
| 100      | 010      | 001        |
| 4        | 2        | 1          |
| 文件可读 | 文件可写 | 文件可执行 |
| 目录可读 | 目录可写 | 目录可搜索 |
**** 说明                                                        :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
1. 目录可读：可以通过ls查看目录中的文件列表
2. 目录可写：可以在目录内创建、删除、移动文件
3. 目录可访问：可以通过cd进入该目录或者搜索其内的文件
*** 三种用户
**** 三种用户的权限                                       :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
ls -l ~/students.db
#+END_SRC

#+RESULTS:
-rw-rw-r--. 1 wxq wxq 115 3月   8 22:35 /home/wxq/students.db

**** 文件所有者(默认为创建该文件的用户)
ls -l输出结果第3列，第一组权限(rw-)
**** 文件所属组
ls -l输出结果第4列，第二组权限(rw-)
**** 其他用户
既不是文件所有者，也不属于文件所属组，第三组权限(r--)
*** 修改文件和目录权限
**** chmod 仅文件所有者和root用户有权修改文件权限
**** 示例                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
chmod u=rw-,g=r--,o=r-- file
chmod g+w,o-r file
chmod a+x file
chmod 644 file
chmod 600 file
chmod 700 dir
chmod -R 755 dir
#+END_SRC
**** 想一想                                                      :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
1. 若用户对某个文件只有读权限，他有没有可能删除该文件？
2. 可否允许其他用户修改某文件，却不能删除或更名该文件？
*** 查看和设置默认权限掩码
**** umask                                                :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
umask      #掩码中某一位为1表示该位对应权限被禁止
umask -S
umask 0026
#+END_SRC
**** 说明                                                        :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
新建文件/目录的权限等于0666/0777与掩码的反码按位相与
**** 算一算                                                      :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
1. 若将umask值设置为0011，则新建文件的默认权限是什么？
2. 若希望新建文件的权限是所有者可读写，属组用户可读，其他用户无权限，则umask值应设为多少？
*** 权限设置实例
**** 问题                                                           :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
xiaobai想在自己的主目录内建立一个公共目录pub，希望所有人都可以只读访问该目录内的文件，但不希望其他人能访问其主目录内的其他文件和目录，请问要怎么配置相关文件/目录的权限才能达到目的呢？
**** 答案                                                         :B_note:
:PROPERTIES:
:BEAMER_env: note
:END:
#+BEGIN_EXAMPLE
1. chmod a+x ~xiaobai
2. umask 0022
3. mkdir pub
4. echo hello >pub/hello.txt
#+END_EXAMPLE
**** 另一个问题                                                   :B_note:
:PROPERTIES:
:BEAMER_env: note
:END:
mike想在自己的主目录内建立一个作业上传目录handin，希望所有学生都可以上传作业到该目录内，但不希望学生能访问其主目录内的其他文件和目录，也不希望学生访问/删除handin目录内其他同学的作业，请问要怎么才能做到呢？
**** 答案                                                         :B_note:
:PROPERTIES:
:BEAMER_env: note
:END:
#+BEGIN_EXAMPLE
1. chmod o+x ~mike
2. mkdir handin
3. chmod 1707 handin #设置其他用户可写，并设置sticky位
4. umask 0077        #设置默认权限? 这样不行，估计只能通过ftp的local_mask实现
#+END_EXAMPLE
** 文件所有权管理
*** chown和chgrp
**** 仅root用户有权更改文件所有者和所属组
**** 示例                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
chown root file         #令file为root所有
chown root:users file   #令file为root所有，属users组
chown root: file        #令file为root所有，属root组
chown :users file       #令file属users组
chown -R root:users dir #递归处理
chgrp users file        #令file属users组
chgrp -R users dir      #递归处理
#+END_SRC
** 特殊权限(s)管理
*** 三种基本权限够用吗？
**** mike用户对文件F具有只读权限，则mike用编辑器vim打开文件F时，vim对文件F也仅具备只读权限。
**** 结论                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
一个程序对文件具备何种权限由启动该程序的用户决定
**** 问题                                                        :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
mike用户对/etc/shadow不具备任何权限，那mike如何通过执行passwd程序修改存放在/etc/shadow内的登录密码呢？
*** setUID权限
**** setUID权限：可执行程序被设置了setUID权限后，无论被谁执行，该程序都将具备其所有者的权限，而不是执行者的权限。
**** 示例                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
ls -l /usr/bin/passwd
chmod u+s file   #设置setUID权限
chmod u-s file   #删除setUID权限
chmod 4751 file  #设置setUID权限
chmod 0751 file  #删除setUID权限
#+END_SRC
*** setGID权限
**** setGID权限：可执行程序被设置了setGID权限后，无论被谁执行，该程序都将具备其所属组的权限，但没有其所有者的权限。
**** 示例                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
ls -l /bin/locate
chmod g+s file
chmod g-s file
chmod 2751 file
#+END_SRC
*** setGID权限(2)
**** setGID权限常针对目录设置：目录设置了setGID权限后，无论谁在该目录内创建的新文件，默认都会属于该目录所属的组，而不是创建者所属的组。
**** 示例                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
mkdir proj_dir
groupadd proj
chgrp proj proj_dir
chmod g+s proj_dir
#+END_SRC
*** Sticky bit权限
**** Sticky bit：目前仅对目录有效，目录设置该权限后，该目录内的所有文件仅文件所有者和root用户才有权力进行删除/更名/移动等操作，
**** 示例                                                 :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
ls -ld /tmp
chmod o+t dir
chmod o-t dir
chmod 1751 dir
#+END_SRC
* 进程管理
** 进程管理
*** 查看进程
**** ps                                                   :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
ps             #查看当前shell执行的进程
ps aux         #查看所有进程(BSD风格)
ps -ef         #查看所有进程(System V风格)
ps -ft /dev/pts/0 #查看与指定终端关联的进程
ps -fp 1234    #查看进程号为1234的进程的详细信息
ps -fu xiaobai #查看用户xiaobai运行的进程信息
ps -fC evince  #查看名称为enince的所有进程信息
#+END_SRC
**** pstree                                                      :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
#+BEGIN_SRC sh
pstree         #打印系统进程树
#+END_SRC
*** 查看进程
**** pgrep                                                        :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
#+BEGIN_SRC sh
pgrep evince  #查找名为evince的进程的进程号
#+END_SRC
**** top                                                  :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
top     #实时系统状态监控
h/?     #帮助
d 5     #设置刷新周期为5秒
k 1234  #杀死进程号为1234的进程
P       #按cpu使用率排序
M       #按memory使用率排序
T       #按cpu使用时间排序
u tom   #仅显示用户tom的进程
q       #退出top
man top
#+END_SRC
*** 进程控制
**** 前后台进程
***** 一个终端一次只能运行一个前台进程，但可以并发运行多个后台进程。
***** 前后台作业控制                                     :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
Ctrl-z              #挂起(暂停)前台进程的执行
jobs [-l]           #查看作业
fg [n]              #将作业恢复至前台执行
bg [n]              #将作业恢复至后台执行
kill %n/pid         #杀死指定的作业/进程
killall xeyes       #杀死所有xeyes进程
pkill eye           #查找包含eye的进程名并杀死
xeyes -center red & #启动后台进程
nohup ./longjob &   #保持后台进程在用户注销后继续运行
nohup ./longjob & >longjob.out
#+END_SRC
*** 进程和信号
