lec03.tex
如果用户不是root，下列情况下将会被提示输入组密码：
1. 如果用户没有密码而要切换的组有密码
2. 如果用户不属于要切换的组，而该组有密码
如果用户不属于要切换的组，且该组未设密码，则拒绝切换
\end{verbatim}
\end{block}
\note{sg


\begin{verbatim}
man sg   #sg与newgrp类似，但也有些不同
\end{verbatim}
}
\end{frame}
\subsection{密码管理}
\label{sec-1-5}
\begin{frame}
\frametitle{加密算法}
\label{sec-1-5-1}
\begin{itemize}

\item DES\\
\label{sec-1-5-1-1}%
传统UNIX使用的加密算法，只能支持8个字符以内的密码，如果超过8个字符，则DES会忽略第8个字符以后的密码，其安全性比较差。

\item MD5\\
\label{sec-1-5-1-2}%
CentOS默认使用的加密算法，支持255个字符的密码，比DES更安全。
\end{itemize} % ends low level
\end{frame}
\begin{frame}[fragile]
\frametitle{查看与设置帐号秘密有效期}
\label{sec-1-5-2}
\begin{exampleblock}{chage}
\label{sec-1-5-2-1}


\begin{minted}[]{bash}
chage -l mike  #查看用户帐号密码有效期信息
#注意：普通用户只能查看自己的帐号密码有效期信息
chage -m 3 mike  #设置设定密码后至少经过几天才能修改密码
chage -M 30 mike #设置设定密码后最长多少天后必须修改密码
chage -d 2016-01-01 mike #设置密码最后修改时间
chage -E 2020-12-31 mike #设置密码过期时间
chage -W 7 mike  #设置密码过期前几天提醒
chage -I 3 mike  #设置密码过期后多少天被锁定
\end{minted}
\end{exampleblock}
\end{frame}
\section{权限管理}
\label{sec-2}
\subsection{基本权限管理}
\label{sec-2-1}
\begin{frame}
\frametitle{文件权限和目录权限}
\label{sec-2-1-1}
\begin{itemize}

\item 三种基本权限\\
\label{sec-2-1-1-1}%
\begin{center}
\begin{tabular}{lll}
 r--       &  -w-       &  --x         \\
\hline
 100       &  010       &  001         \\
 4         &  2         &  1           \\
 文件可读  &  文件可写  &  文件可执行  \\
 目录可读  &  目录可写  &  目录可搜索  \\
\end{tabular}
\end{center}


\end{itemize} % ends low level
\begin{block}{说明}
\label{sec-2-1-1-2}

\begin{enumerate}
\item 目录可读：可以通过ls查看目录中的文件列表
\item 目录可写：可以在目录内创建、删除、移动文件
\item 目录可访问：可以通过cd进入该目录或者搜索其内的文件
\end{enumerate}
\end{block}
\end{frame}
\begin{frame}[fragile]
\frametitle{三种用户}
\label{sec-2-1-2}
\begin{exampleblock}{三种用户的权限}
\label{sec-2-1-2-1}


\begin{minted}[]{bash}
ls -l ~/students.db
\end{minted}
-rw-rw-r--. 1 wxq wxq 115 3月   8 22:35 /home/wxq/students.db
\end{exampleblock}
\begin{itemize}

\item 文件所有者(默认为创建该文件的用户)\\
\label{sec-2-1-2-2}%
ls -l输出结果第3列，第一组权限(rw-)

\item 文件所属组\\
\label{sec-2-1-2-3}%
ls -l输出结果第4列，第二组权限(rw-)

\item 其他用户\\
\label{sec-2-1-2-4}%
既不是文件所有者，也不属于文件所属组，第三组权限(r--)
\end{itemize} % ends low level
\end{frame}
\begin{frame}[fragile]
\frametitle{修改文件和目录权限}
\label{sec-2-1-3}
\begin{itemize}

\item chmod 仅文件所有者和root用户有权修改文件权限
\label{sec-2-1-3-1}%
\end{itemize} % ends low level
\begin{exampleblock}{示例}
\label{sec-2-1-3-2}


\begin{minted}[]{bash}
chmod u=rw-,g=r--,o=r-- file
chmod g+w,o-r file
chmod a+x file
chmod 644 file
chmod 600 file
chmod 700 dir
chmod -R 755 dir
\end{minted}
\end{exampleblock}
\begin{block}{想一想}
\label{sec-2-1-3-3}

\begin{enumerate}
\item 若用户对某个文件只有读权限，他有没有可能删除该文件？
\item 可否允许其他用户修改某文件，却不能删除或更名该文件？
\end{enumerate}
\end{block}
\end{frame}
\begin{frame}[fragile]
\frametitle{查看和设置默认权限掩码}
\label{sec-2-1-4}
\begin{exampleblock}{umask}
\label{sec-2-1-4-1}


\begin{minted}[]{bash}
umask      #掩码中某一位为1表示该位对应权限被禁止
umask -S
umask 0026
\end{minted}
\end{exampleblock}
\begin{block}{说明}
\label{sec-2-1-4-2}

新建文件/目录的权限等于0666/0777与掩码的反码按位相与
\end{block}
\begin{block}{算一算}
\label{sec-2-1-4-3}

\begin{enumerate}
\item 若将umask值设置为0011，则新建文件的默认权限是什么？
\item 若希望新建文件的权限是所有者可读写，属组用户可读，其他用户无权限，则umask值应设为多少？
\end{enumerate}
\end{block}
\end{frame}
\begin{frame}[fragile]
\frametitle{权限设置实例}
\label{sec-2-1-5}
\begin{block}{问题}
\label{sec-2-1-5-1}

xiaobai想在自己的主目录内建立一个公共目录pub，希望所有人都可以只读访问该目录内的文件，但不希望其他人能访问其主目录内的其他文件和目录，请问要怎么配置相关文件/目录的权限才能达到目的呢？
\end{block}
\note{答案


\begin{verbatim}
1. chmod a+x ~xiaobai
2. umask 0022
3. mkdir pub
4. echo hello >pub/hello.txt
\end{verbatim}
}
\note{另一个问题

mike想在自己的主目录内建立一个作业上传目录handin，希望所有学生都可以上传作业到该目录内，但不希望学生能访问其主目录内的其他文件和目录，也不希望学生访问/删除handin目录内其他同学的作业，请问要怎么才能做到呢？
}
\note{答案


\begin{verbatim}
1. chmod o+x ~mike
2. mkdir handin
3. chmod 1707 handin #设置其他用户可写，并设置sticky位
4. umask 0077        #设置默认权限? 这样不行，估计只能通过ftp的local_mask实现
\end{verbatim}
}
\end{frame}
\subsection{文件所有权管理}
\label{sec-2-2}
\begin{frame}[fragile]
\frametitle{chown和chgrp}
\label{sec-2-2-1}
\begin{itemize}

\item 仅root用户有权更改文件所有者和所属组
\label{sec-2-2-1-1}%
\end{itemize} % ends low level
\begin{exampleblock}{示例}
\label{sec-2-2-1-2}


\begin{minted}[]{bash}
chown root file         #令file为root所有
chown root:users file   #令file为root所有，属users组
chown root: file        #令file为root所有，属root组
chown :users file       #令file属users组
chown -R root:users dir #递归处理
chgrp users file        #令file属users组
chgrp -R users dir      #递归处理
\end{minted}
\end{exampleblock}
\end{frame}
\subsection{特殊权限(s)管理}
\label{sec-2-3}
\begin{frame}
\frametitle{三种基本权限够用吗？}
\label{sec-2-3-1}
\begin{itemize}

\item mike用户对文件F具有只读权限，则mike用编辑器vim打开文件F时，vim对文件F也仅具备只读权限。
\label{sec-2-3-1-1}%
\end{itemize} % ends low level
\begin{exampleblock}{结论}
\label{sec-2-3-1-2}

一个程序对文件具备何种权限由启动该程序的用户决定
\end{exampleblock}
\begin{block}{问题}
\label{sec-2-3-1-3}

mike用户对/etc/shadow不具备任何权限，那mike如何通过执行passwd程序修改存放在/etc/shadow内的登录密码呢？
\end{block}
\end{frame}
\begin{frame}[fragile]
\frametitle{setUID权限}
\label{sec-2-3-2}
\begin{itemize}

\item setUID权限：可执行程序被设置了setUID权限后，无论被谁执行，该程序都将具备其所有者的权限，而不是执行者的权限。
\label{sec-2-3-2-1}%
\end{itemize} % ends low level
\begin{exampleblock}{示例}
\label{sec-2-3-2-2}


\begin{minted}[]{bash}
ls -l /usr/bin/passwd
chmod u+s file   #设置setUID权限
chmod u-s file   #删除setUID权限
chmod 4751 file  #设置setUID权限
chmod 0751 file  #删除setUID权限
\end{minted}
\end{exampleblock}
\end{frame}
\begin{frame}[fragile]
\frametitle{setGID权限}
\label{sec-2-3-3}
\begin{itemize}

\item setGID权限：可执行程序被设置了setGID权限后，无论被谁执行，该程序都将具备其所属组的权限，但没有其所有者的权限。
\label{sec-2-3-3-1}%
\end{itemize} % ends low level
\begin{exampleblock}{示例}
\label{sec-2-3-3-2}


\begin{minted}[]{bash}
ls -l /bin/locate
chmod g+s file
chmod g-s file
chmod 2751 file
\end{minted}
\end{exampleblock}
\end{frame}
\begin{frame}[fragile]
\frametitle{setGID权限(2)}
\label{sec-2-3-4}
\begin{itemize}

\item setGID权限常针对目录设置：目录设置了setGID权限后，无论谁在该目录内创建的新文件，默认都会属于该目录所属的组，而不是创建者所属的组。
\label{sec-2-3-4-1}%
\end{itemize} % ends low level
\begin{exampleblock}{示例}
\label{sec-2-3-4-2}


\begin{minted}[]{bash}
mkdir proj_dir
groupadd proj
chgrp proj proj_dir
chmod g+s proj_dir
\end{minted}
\end{exampleblock}
\end{frame}
\begin{frame}[fragile]
\frametitle{Sticky bit权限}
\label{sec-2-3-5}
\begin{itemize}

\item Sticky bit：目前仅对目录有效，目录设置该权限后，该目录内的所有文件仅文件所有者和root用户才有权力进行删除/更名/移动等操作，
\label{sec-2-3-5-1}%
\end{itemize} % ends low level
\begin{exampleblock}{示例}
\label{sec-2-3-5-2}


\begin{minted}[]{bash}
ls -ld /tmp
chmod o+t dir
chmod o-t dir
chmod 1751 dir
\end{minted}
\end{exampleblock}
\end{frame}
\section{进程管理}
\label{sec-3}
\subsection{进程管理}
\label{sec-3-1}
\begin{frame}[fragile]
\frametitle{查看进程}
\label{sec-3-1-1}
\begin{exampleblock}{ps}
\label{sec-3-1-1-1}


\begin{minted}[]{bash}
ps             #查看当前shell执行的进程
ps aux         #查看所有进程(BSD风格)
ps -ef         #查看所有进程(System V风格)
ps -ft /dev/pts/0 #查看与指定终端关联的进程
ps -fp 1234    #查看进程号为1234的进程的详细信息
ps -fu xiaobai #查看用户xiaobai运行的进程信息
ps -fC evince  #查看名称为enince的所有进程信息
\end{minted}
\end{exampleblock}
\begin{block}{pstree}
\label{sec-3-1-1-2}


\begin{minted}[]{bash}
pstree         #打印系统进程树
\end{minted}
\end{block}
\end{frame}
\begin{frame}[fragile]
\frametitle{查看进程}
\label{sec-3-1-2}
\begin{block}{pgrep}
\label{sec-3-1-2-1}


\begin{minted}[]{bash}
pgrep evince  #查找名为evince的进程的进程号
\end{minted}
\end{block}
\begin{exampleblock}{top}
\label{sec-3-1-2-2}


\begin{minted}[]{bash}
top     #实时系统状态监控
h/?     #帮助
d 5     #设置刷新周期为5秒
k 1234  #杀死进程号为1234的进程
P       #按cpu使用率排序
M       #按memory使用率排序
T       #按cpu使用时间排序
u tom   #仅显示用户tom的进程
q       #退出top
man top
\end{minted}
\end{exampleblock}
\end{frame}
\begin{frame}[fragile]
\frametitle{进程控制}
\label{sec-3-1-3}
\begin{itemize}

\item 前后台进程
\label{sec-3-1-3-1}%
\begin{itemize}

\item 一个终端一次只能运行一个前台进程，但可以并发运行多个后台进程。
\label{sec-3-1-3-1-1}%
\end{itemize} % ends low level
\begin{exampleblock}{前后台作业控制}
\label{sec-3-1-3-1-2}


\begin{minted}[]{bash}
Ctrl-z              #挂起(暂停)前台进程的执行
jobs [-l]           #查看作业
fg [n]              #将作业恢复至前台执行
bg [n]              #将作业恢复至后台执行
kill %n/pid         #杀死指定的作业/进程
killall xeyes       #杀死所有xeyes进程
pkill eye           #查找包含eye的进程名并杀死
xeyes -center red & #启动后台进程
nohup ./longjob &   #保持后台进程在用户注销后继续运行
nohup ./longjob & >longjob.out
\end{minted}
\end{exampleblock}
\end{itemize} % ends low level
\end{frame}
