lec03.org
**** 信号
内核用信号通知进程发生的异常事件和实现进程间通信，进程也可以给其他进程。每种信号可以用名称或整数标识。
1. 硬件异常：进程让硬件执行错误操作，如进程进行除0运算，内核会给它发送SIGFPE(8)
2. 软件状态：把异常的软件状态通知进程，如进程终止时，内核会向父进程发送SIGCHLD（17），当调整X图形应用程序的窗口大小时，该程序会收到SIGWINCH(28)
3. 终端中断：用户敲入的终端控制组合键会把信号发送给shell前台进程，如Ctrl-c发送SIGINT(2)，Ctrl-z发送SIGSTP(20)
4. 其他进程：进程可以通过kill命令给同一用户拥有的其他任何进程发送任何信号
*** 向进程发信号
**** 信号：
**** kill 发送信号给进程                                     :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
kill -l              #打印信号值列表
man 7 signal         #查看信号相关帮助
Ctrl-c               #发送信号2给前台进程
Ctrl-z               #发送信号20给前台进程
kill -19 12121       #暂停
kill -18 12121       #恢复
kill -15 12345       #发送信号15给进程12345
kill 12345           #同上
kill -9 11111        #强行杀死进程11111
kill -s SIGTERM 1234 #发送信号SIGTERM给进程1234
#+END_SRC
*** 进程优先级
**** 优先级(priority)与谦让值(nice)
top命令的输出中，PR是内核用于进程调度的动态优先级，而NI是用户可以设置的谦让值。NI可以影响PR，PR与NI越小则进程优先级越高。
nice值可以从-20至19，默认为0。
**** nice  以指定nice值启动进程                              :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
xeyes -center red &        #默认nice值为0
nice xeyes -center blue &  #默认设置nice值为10
nice -n 5 xeyes -center green &
ps -l   #查看进程的PR与NI值
#+END_SRC
**** 注意                                                        :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
只有root用户可以在nice命令中为进程指定负nice值
*** 进程优先级(2)
**** renice  调整进程nice值                                  :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
renice 15 12707     #将进程12707的nice值调整为15
renice -5 12675     #将进程12675的nice值调整为-5
renice 8 -u mike    #将用户mike的进程nice值调整为8
renice 0 -g users   #将用户组users的进程nice值调整为0
#+END_SRC
**** 注意                                                        :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
只有root用户可以通过renice减小进程的nice值
*** 守护进程(Daemon)
**** 守护进程(daemon)
***** 守护进程是那些在后台运行的进程，脱离控制终端，守护进程与系统服务像关联，如日志守护进程syslogd、安全shell守护进程sshd等，守护进程名一般以d结尾。
***** 守护进程通常作为系统启动过程的一部分被启动，或者由root用户启动，有些守护进程以root用户身份运行，有些守护进程则以特定的系统用户身份运行。
*** at/batch 一次性计划任务
**** atd守护进程：运行用户提交稍后运行的作业
**** 用at命令提交作业                                     :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
at 2:00 am
at> find / -mtime 0 -exec cp -p {} /bak \;
at> Ctrl-d
at 22:30 <task1
at -f task2 now+1h
atq           #查看作业队列，同at -l
atrm 2        #删除作业2，同at -d 2
man at
#+END_SRC
*** at/batch 一次性计划任务(2)
**** 用batch提交作业
***** batch与at的语法与at相同，但batch作业不在特定时间运行，而是等到系统负载较轻时运行。atd会监控系统平均负载，等待它降低到0.8以下，然后开始运行作业任务。
*** cron 重复性计划任务
**** cron允许用户配置要定期运行的命令，用户用crontab命令配置自己的任务计划(crontab)。
**** cron在/var/spool/cron目录下搜索以用户名命名的crontab文件，以及/etc/crontab文件和/etc/cron.d目录下的crontab文件，cron每分钟醒来一次检查是否有需要运行的作业。
**** crontab命令                                          :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_SRC sh
crontab -e   #编辑计划任务
crontab file #从file创建计划任务
crontab -l   #列出计划任务
crontab -e   #删除计划任务
#+END_SRC
*** cron 重复性计划任务(2)
**** 计划任务格式                                                :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
#+BEGIN_EXAMPLE
分钟 小时 几号 几月 星期几 [用户] 命令
注：用户计划任务无需用户字段
#+END_EXAMPLE
**** 示例                              :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
#+BEGIN_EXAMPLE
SHELL=/bin/sh    #使用/bin/sh执行命令
MAILTO=mike      #发邮件给mike
 5  0  *  *  *   $HOME/bin/daily.job >>$HOME/tmp/out 2>&1
15 14  1  *  *   $HOME/bin/monthly.job
 0 22  *  * 1-5  $HOME/bin/workday.job
23 0-23/2 * * *  $HOME/bin/twohours.job
 5  4  *  * sun  $HOME/bin/sunday.job    
#+END_EXAMPLE
* shell环境
** shell环境变量
*** 查看和修改shell环境变量
**** 查看shell环境变量
#+BEGIN_SRC sh
env
echo $SHELL
#+END_SRC
**** 修改shell环境变量
#+BEGIN_SRC sh
export HISTSIZE=500
#+END_SRC
**** 说明                                                        :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
上述修改仅对当前会话有效！
** shell配置文件
*** bash配置文件
**** 系统级配置文件                                       :B_exampleblock:
:PROPERTIES:
:BEAMER_env: exampleblock
:END:
1. /etc/profile       用户登录时运行
2. /etc/bashrc        启动bash时运行
**** 用户级配置文件                                              :B_block:
:PROPERTIES:
:BEAMER_env: block
:END:
1. .bash\_profile     用户登录时运行
2. .bashrc            启动bash时运行
3. .bash\_logout      用户注销时运行
4. .bash\_history     保存用户命令历史
