lec03.tex
\begin{frame}
\frametitle{进程和信号}
\label{sec-3-1-4}
\begin{itemize}

\item 信号\\
\label{sec-3-1-4-1}%
内核用信号通知进程发生的异常事件和实现进程间通信，进程也可以给其他进程。每种信号可以用名称或整数标识。
\begin{enumerate}
\item 硬件异常：进程让硬件执行错误操作，如进程进行除0运算，内核会给它发送SIGFPE(8)
\item 软件状态：把异常的软件状态通知进程，如进程终止时，内核会向父进程发送SIGCHLD（17），当调整X图形应用程序的窗口大小时，该程序会收到SIGWINCH(28)
\item 终端中断：用户敲入的终端控制组合键会把信号发送给shell前台进程，如Ctrl-c发送SIGINT(2)，Ctrl-z发送SIGSTP(20)
\item 其他进程：进程可以通过kill命令给同一用户拥有的其他任何进程发送任何信号
\end{enumerate}
\end{itemize} % ends low level
\end{frame}
\begin{frame}[fragile]
\frametitle{向进程发信号}
\label{sec-3-1-5}
\begin{itemize}

\item 信号：
\label{sec-3-1-5-1}%
\end{itemize} % ends low level
\begin{exampleblock}{kill 发送信号给进程}
\label{sec-3-1-5-2}


\begin{minted}[]{bash}
kill -l              #打印信号值列表
man 7 signal         #查看信号相关帮助
Ctrl-c               #发送信号2给前台进程
Ctrl-z               #发送信号20给前台进程
kill -19 12121       #暂停
kill -18 12121       #恢复
kill -15 12345       #发送信号15给进程12345
kill 12345           #同上
kill -9 11111        #强行杀死进程11111
kill -s SIGTERM 1234 #发送信号SIGTERM给进程1234
\end{minted}
\end{exampleblock}
\end{frame}
\begin{frame}[fragile]
\frametitle{进程优先级}
\label{sec-3-1-6}
\begin{itemize}

\item 优先级(priority)与谦让值(nice)\\
\label{sec-3-1-6-1}%
top命令的输出中，PR是内核用于进程调度的动态优先级，而NI是用户可以设置的谦让值。NI可以影响PR，PR与NI越小则进程优先级越高。
nice值可以从-20至19，默认为0。
\end{itemize} % ends low level
\begin{exampleblock}{nice  以指定nice值启动进程}
\label{sec-3-1-6-2}


\begin{minted}[]{bash}
xeyes -center red &        #默认nice值为0
nice xeyes -center blue &  #默认设置nice值为10
nice -n 5 xeyes -center green &
ps -l   #查看进程的PR与NI值
\end{minted}
\end{exampleblock}
\begin{block}{注意}
\label{sec-3-1-6-3}

只有root用户可以在nice命令中为进程指定负nice值
\end{block}
\end{frame}
\begin{frame}[fragile]
\frametitle{进程优先级(2)}
\label{sec-3-1-7}
\begin{exampleblock}{renice  调整进程nice值}
\label{sec-3-1-7-1}


\begin{minted}[]{bash}
renice 15 12707     #将进程12707的nice值调整为15
renice -5 12675     #将进程12675的nice值调整为-5
renice 8 -u mike    #将用户mike的进程nice值调整为8
renice 0 -g users   #将用户组users的进程nice值调整为0
\end{minted}
\end{exampleblock}
\begin{block}{注意}
\label{sec-3-1-7-2}

只有root用户可以通过renice减小进程的nice值
\end{block}
\end{frame}
\begin{frame}
\frametitle{守护进程(Daemon)}
\label{sec-3-1-8}
\begin{itemize}

\item 守护进程(daemon)
\label{sec-3-1-8-1}%
\begin{itemize}

\item 守护进程是那些在后台运行的进程，脱离控制终端，守护进程与系统服务像关联，如日志守护进程syslogd、安全shell守护进程sshd等，守护进程名一般以d结尾。
\label{sec-3-1-8-1-1}%

\item 守护进程通常作为系统启动过程的一部分被启动，或者由root用户启动，有些守护进程以root用户身份运行，有些守护进程则以特定的系统用户身份运行。
\label{sec-3-1-8-1-2}%
\end{itemize} % ends low level
\end{itemize} % ends low level
\end{frame}
\begin{frame}[fragile]
\frametitle{at/batch 一次性计划任务}
\label{sec-3-1-9}
\begin{itemize}

\item atd守护进程：运行用户提交稍后运行的作业
\label{sec-3-1-9-1}%
\end{itemize} % ends low level
\begin{exampleblock}{用at命令提交作业}
\label{sec-3-1-9-2}


\begin{minted}[]{bash}
at 2:00 am
at> find / -mtime 0 -exec cp -p {} /bak \;
at> Ctrl-d
at 22:30 <task1
at -f task2 now+1h
atq           #查看作业队列，同at -l
atrm 2        #删除作业2，同at -d 2
man at
\end{minted}
\end{exampleblock}
\end{frame}
\begin{frame}
\frametitle{at/batch 一次性计划任务(2)}
\label{sec-3-1-10}
\begin{itemize}

\item 用batch提交作业
\label{sec-3-1-10-1}%
\begin{itemize}

\item batch与at的语法与at相同，但batch作业不在特定时间运行，而是等到系统负载较轻时运行。atd会监控系统平均负载，等待它降低到0.8以下，然后开始运行作业任务。
\label{sec-3-1-10-1-1}%
\end{itemize} % ends low level
\end{itemize} % ends low level
\end{frame}
\begin{frame}[fragile]
\frametitle{cron 重复性计划任务}
\label{sec-3-1-11}
\begin{itemize}

\item cron允许用户配置要定期运行的命令，用户用crontab命令配置自己的任务计划(crontab)。
\label{sec-3-1-11-1}%

\item cron在/var/spool/cron目录下搜索以用户名命名的crontab文件，以及/etc/crontab文件和/etc/cron.d目录下的crontab文件，cron每分钟醒来一次检查是否有需要运行的作业。
\label{sec-3-1-11-2}%
\end{itemize} % ends low level
\begin{exampleblock}{crontab命令}
\label{sec-3-1-11-3}


\begin{minted}[]{bash}
crontab -e   #编辑计划任务
crontab file #从file创建计划任务
crontab -l   #列出计划任务
crontab -e   #删除计划任务
\end{minted}
\end{exampleblock}
\end{frame}
\begin{frame}[fragile]
\frametitle{cron 重复性计划任务(2)}
\label{sec-3-1-12}
\begin{block}{计划任务格式}
\label{sec-3-1-12-1}


\begin{verbatim}
分钟 小时 几号 几月 星期几 [用户] 命令
注：用户计划任务无需用户字段
\end{verbatim}
\end{block}
\begin{exampleblock}{示例}
\label{sec-3-1-12-2}


\begin{verbatim}
SHELL=/bin/sh    #使用/bin/sh执行命令
MAILTO=mike      #发邮件给mike
 5  0  *  *  *   $HOME/bin/daily.job >>$HOME/tmp/out 2>&1
15 14  1  *  *   $HOME/bin/monthly.job
 0 22  *  * 1-5  $HOME/bin/workday.job
23 0-23/2 * * *  $HOME/bin/twohours.job
 5  4  *  * sun  $HOME/bin/sunday.job
\end{verbatim}
\end{exampleblock}
\end{frame}
\section{shell环境}
\label{sec-4}
\subsection{shell环境变量}
\label{sec-4-1}
\begin{frame}[fragile]
\frametitle{查看和修改shell环境变量}
\label{sec-4-1-1}
\begin{itemize}

\item 查看shell环境变量\\
\label{sec-4-1-1-1}%
\begin{minted}[]{bash}
env
echo $SHELL
\end{minted}

\item 修改shell环境变量\\
\label{sec-4-1-1-2}%
\begin{minted}[]{bash}
export HISTSIZE=500
\end{minted}
\end{itemize} % ends low level
\begin{block}{说明}
\label{sec-4-1-1-3}

上述修改仅对当前会话有效！
\end{block}
\end{frame}
\subsection{shell配置文件}
\label{sec-4-2}
\begin{frame}
\frametitle{bash配置文件}
\label{sec-4-2-1}
\begin{exampleblock}{系统级配置文件}
\label{sec-4-2-1-1}

\begin{enumerate}
\item /etc/profile       用户登录时运行
\item /etc/bashrc        启动bash时运行
\end{enumerate}
\end{exampleblock}
\begin{block}{用户级配置文件}
\label{sec-4-2-1-2}

\begin{enumerate}
\item .bash\_profile     用户登录时运行
\item .bashrc            启动bash时运行
\item .bash\_logout      用户注销时运行
\item .bash\_history     保存用户命令历史
\end{enumerate}
\end{block}
\end{frame}

\end{document}
